library random_food.globals;

// 글로벌 변수
List kor = ['국밥','삼겹살','전','찌개','매운탕','볶음밥','김밥','비빔밥','죽'];
List eu = ['스테이크', '피자', '파스타','리조또','버거','수프','팬케이크'];
List brunch = ['파스타','샐러드','부리또','샌드위치','팬케이크'];
List chn = ['만두', '마라탕', '짬뽕','딤섬','짜장면'];
List jpn = ['연어', '라멘', '회','초밥','우동','소바','오코노미야키'];
List asia = ['치킨','라면','떡볶이','만두','삼겹살','칼국수','족발','타코','라멘','돈까스','샤브샤브','닭갈비','찜닭','짬뽕','양꼬치','쌀국수','전','팟다이','볶음밥','김밥','덮밥','비빔밥','딤삼','우동','소바','부리또','짜장면','닭발','오코노미야키','카레','타코야키','쭈꾸미볶음'];
List noodle = ['라면', '칼국수', '마라탕','마라탕','파스타','짬뽕','쌀국수','팟타이','우동','소바','짜장면'];
List rice = ['국밥', '초밥', '전','찌개','매운탕','볶음밥','김밥','덮밥','비빔밥','탕','도시락','카레','죽'];
List meat = ['곱창', '삼겹살', '스테이크','족발','샤브샤브','닭갈비','찜닭','양꼬치','갈비','보쌈','수육','닭발','육회'];
List light = ['치킨', '라면', '떡볶이','만두','타코','김밥','딤섬','부리또','버거','도시락','오코노미야키'];
List glutenFree = ['연어','초밥','포케','샐러드',];

List total = ['치킨','곱창','떡볶이','국밥','만두','연어','삼겹살','스테이크','칼국수','족발','타코','라멘','피자','돈까스','회','마라탕','초밥','파스타','리조또','샤브샤브','닭갈비','찜닭','짬뽕','양꼬치','쌀국수','전','찌개','매운탕','팟타이','볶음밥','샐러드','김밥','덮밥','비빔밥','갈비','탕','딤섬','우동','소바','보쌈','수육','부리또','버거','짜장면','도시락','닭발','샌드위치','육회','조개구이','오코노미야키','카레','수프','팬케이크','포케','칵테일','타코야키','고구마','옥수수','쭈꾸미볶음'];
Map<String, List> mapItem = {
  '전체': total,
  "중국": chn,
  "한국": kor,
  "일본": jpn,
  "동남아": asia,
  "유럽": eu,
  "브런치": brunch,
};

Map mapImage = {
  '치킨': 0,
  '라면': 1,
  '곱창': 2,
  '떡볶이': 3,
  '국밥': 4,
  '만두': 5,
  '연어': 6,
  '삼겹살': 7,
  '스테이크': 8,
  '칼국수': 9,
  '족발': 10,
  '타코': 11,
  '라멘': 12,
  '피자': 13,
  '돈까스': 14,
  '회': 15,
  '마라탕': 16,
  '초밥': 17,
  '파스타': 18,
  '리조또': 19,
  '샤브샤브': 20,
  '닭갈비': 21,
  '찜닭': 22,
  '짬뽕': 23,
  '양꼬치': 24,
  '쌀국수': 25,
  '전': 26,
  '찌개': 27,
  '매운탕': 28,
  '팟타이': 29,
  '볶음밥': 30,
  '샐러드': 31,
  '김밥': 32,
  '덮밥': 33,
  '비빔밥': 34,
  '갈비': 35,
  '탕': 36,
  '딤섬': 37,
  '우동': 38,
  '소바': 39,
  '보쌈': 40,
  '수육': 41,
  '부리또': 42,
  '버거': 43,
  '짜장면': 44,
  '도시락': 45,
  '닭발': 46,
  '샌드위치': 47,
  '육회': 48,
  '조개구이': 49,
  '오코노미야키': 50,
  '카레': 51,
  '수프': 52,
  '팬케이크': 53,
  '포케': 54,
  '죽': 55,
  '구운 계란': 56,
  '타코야키': 57,
  '고구마': 58,
  '옥수수': 59,
  '쭈꾸미볶음': 60,
};
